[
  {
    "id": 8,
    "title": "July 2025: A Month of Growth, Code, and Action",
    "text": "July was a month of intense focus and productive momentum. Between job applications, technical development, fitness routines, and entertainment, it was a well-rounded...",
    "link": "https://mxhdiqaim.hashnode.dev/july-2025-a-month-of-growth-code-and-action"
  },

  {
    "id": 7,
    "title": "Monthly Review: June 2025 – A monthly Journey in Learning and Tech",
    "text": "June was a month rich with new lessons, technical breakthroughs, and personal projects. I doubled down on system programming (especially Rust), worked on coding tasks...",
    "link": "https://mxhdiqaim.hashnode.dev/monthly-review-june-2025-a-monthly-journey-in-learning-and-tech"
  },
  {
    "id": 6,
    "title": "How computer boot: Step-by-Step Flowchart Explained",
    "text": "The boot process is the sequence of events a computer follows to transition from being powered off to a fully operational state with the operating system running...",
    "link": "https://mxhdiqaim.hashnode.dev/how-computer-boot-step-by-step-flowchart-explained"
  },
  {
    "id": 0,
    "title": "Fuzzy Password Recovery: Using Similarity Tokens for a More Forgiving Password System",
    "text": "In today's digital landscape, password security is paramount. However, traditional systems that store only a one-way cryptographic hash of your password come with a drawback...",
    "link": "https://mxhdiqaim.hashnode.dev/fuzzy-password-recovery-using-similarity-tokens-for-a-more-forgiving-password-system"
  },
  {
    "id": 1,
    "title": "The Funny Side of Programming",
    "text": "Programming can be a serious business, but that doesn't mean it can't be funny. A little humour can go a long way in making the job more enjoyable...",
    "link": "https://mxhdiqaim.hashnode.dev/the-funny-side-of-programming"
  },
  {
    "id": 2,
    "title": "CSS methodologies for web designers",
    "text": "Before we get going, let us know what is CSS methodologies. A CSS methodology is a set of standards for writing modular, reusable, and scalable code...",
    "link": "https://mxhdiqaim.hashnode.dev/css-methodologies-for-web-designers"
  },
  {
    "id": 3,
    "title": "React Native Stack Navigations",
    "text": "What is Stack Navigation? If you come from a web development background, then it is very easy for you to grasp what is Stack Navigations...",
    "link": "https://mxhdiqaim.hashnode.dev/adding-typescript-to-existing-reactjs-application"
  },
  {
    "id": 4,
    "title": "Adding TypeScript to existing ReactJS application",
    "text": "You already have running React app, and wanted to add TypeScript to it, Must of the cases, there is a high possibility of your app to break...",
    "link": "https://mxhdiqaim.hashnode.dev/adding-typescript-to-existing-reactjs-application"
  },
  {
    "id": 5,
    "title": "Adding/upgrading tailwind CSS to v3.0 to existing ReactJS application",
    "text": "You already have React app up and running for some reason you wish to add tailwind to it or upgrade the version of tailwind, don't worry, I got you covered...",
    "link": "https://mxhdiqaim.hashnode.dev/adding-tailwind-css-to-v30-to-existing-reactjs-application"
  }
]
